prickle/ESP32-Unified-Radio/src/bluetooth.cpp
static void ffBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);  
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_FAST_FORWARD, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_FAST_FORWARD, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

static void forwardBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);  
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_FORWARD, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_FORWARD, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

bool isBtConnected() {
  return currentConnectionState;
}

//Bluetooth events
#define BT_GAP_EVENT 0
#define BT_CONN_EVENT 1
#define BT_VOL_EVENT 2
#define BT_META_EVENT 3
#define BT_STATE_EVENT 4
#define BT_SR_EVENT 5
#define BT_POS_EVENT 6
#define BT_RSSI_EVENT 7
#define BT_RNAME_EVENT 8

//Called from audio message handler to deal with bluetooth related messages
void bluetoothMessage(uint32_t source, uint32_t val, const char* txt) {
  if (settings->mode != MODE_BT) return;
  if (source == BT_GAP_EVENT) {
    serial.println(txt);
  }
  else if (source == BT_CONN_EVENT) {
    currentConnectionState = val;
    if (val) {
      if (rName) {    
        info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected to %s", rName);
      } 
      else info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected");
    }
    else {
      info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Disconnected");
      info(NAME, 0, LV_SYMBOL_STOP " Stopped");
      info(NOW, 0, "");
      rName = NULL;
      gotMetadata = false;
    }
  }
  else if (source == BT_VOL_EVENT) {
    //serial.printf("> BT Set Volume: %d\r\n", val);
    settings->dabVolume = val * 21.0f / 127.0f; 
    setVolume(settings->dabVolume);
    if (dabVolSlider) {
      lv_slider_set_value(dabVolSlider, settings->dabVolume, LV_ANIM_OFF);
    }
  }
  else if (source == BT_META_EVENT) {
    gotMetadata = true;
    if (val == ESP_AVRC_MD_ATTR_TITLE) audio_showstreamtitle(txt);
    else if (val == ESP_AVRC_MD_ATTR_ARTIST) audio_showstation(txt);
    //serial.printf(">: %d: %s\r\n", val, txt);
  }
  else if (source == BT_STATE_EVENT) {
    currentPlayStatus = val;
    uint8_t infoLine = NAME;
    if (gotMetadata) infoLine = TEXT;
    if (currentPlayStatus == ESP_AVRC_PLAYBACK_PLAYING) info(infoLine, 0, LV_SYMBOL_PLAY " Playing");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_STOPPED) info(infoLine, 0, LV_SYMBOL_STOP " Stopped");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_PAUSED) info(infoLine, 0, LV_SYMBOL_PAUSE " Paused");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_FWD_SEEK) info(infoLine, 0, LV_SYMBOL_RIGHT " Fast Forward");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_REV_SEEK) info(infoLine, 0, LV_SYMBOL_LEFT, " Rewind");
    updatePlayButton();
  }
  else if (source == BT_SR_EVENT) {
    currentSampleRate = val;
    setSampleRate(currentSampleRate);
  }
  else if (source == BT_POS_EVENT) {
    //Not using this right now
  }
  else if (source == BT_RSSI_EVENT) {
    if (val > 128) val = 128;
    val = val * 100 / 128.0f;
    char s[25] = {0};
    snprintf(s, 24, LV_SYMBOL_WIFI " %d%%", val);
    setSigStrengthLbl(s);    
  }
  else if (source == BT_RNAME_EVENT) {
    rName = txt;
    if (currentConnectionState)
      info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected to %s", rName);
  }
}

//-------------------------------------------------------
// Threaded below - called from audio thread

void bt_data_cb(const uint8_t *data, uint32_t len);
void bt_gap_cb(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param);
void bt_rc_ct_cb(esp_avrc_ct_cb_event_t event, esp_avrc_ct_cb_param_t *param);
void bt_rc_tg_cb(esp_avrc_tg_cb_event_t event, esp_avrc_tg_cb_param_t *param);
void bt_a2d_cb(esp_a2d_cb_event_t event, esp_a2d_cb_param_t *param);

bool btConnected = false;
bool btVolNotify = false;
bool btPassNotify = false;
uint8_t btVolume = 0;
uint16_t btRemoteFeaturesFlag = 0;
int8_t lastRSSI = 0;
char remoteName[ESP_BT_GAP_MAX_BDNAME_LEN];
bool rssiActive = true;
esp_bd_addr_t peerAddress = {0};

// AVRCP used transaction label
#define APP_RC_CT_TL_GET_CAPS            (0)
#define APP_RC_CT_TL_GET_META_DATA       (1)
#define APP_RC_CT_TL_RN_TRACK_CHANGE     (2)
#define APP_RC_CT_TL_RN_PLAYBACK_CHANGE  (3)
#define APP_RC_CT_TL_RN_PLAY_POS_CHANGE  (4)
#define ESP_AVRC_FEAT_FLAG_TG_COVER_ART  (0x0100)                     /*!< TG support Cover Art */


static esp_avrc_rn_evt_cap_mask_t s_avrc_peer_rn_cap;


//Start the Bluetooth stack - called from the audio thread
void startBT() {
  // set up bluetooth classic via bluedroid
  esp_bt_controller_mem_release(ESP_BT_MODE_BLE);
  setSampleRate(44100);
  setBitsPerSample(16);
  setChannels(2);
  btStart();
  esp_bluedroid_init();
  esp_bluedroid_enable();

  // set up device name
  const char *dev_name = RADIONAME;
  esp_bt_dev_set_device_name(dev_name);

  // initialize AVRCP controller
  esp_avrc_ct_init();
  esp_avrc_ct_register_callback(bt_rc_ct_cb);
  esp_avrc_tg_init();
  esp_avrc_tg_register_callback(bt_rc_tg_cb);

  esp_avrc_rn_evt_cap_mask_t evt_set = {0};
  esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_SET, &evt_set, ESP_AVRC_RN_VOLUME_CHANGE);
  assert(esp_avrc_tg_set_rn_evt_cap(&evt_set) == ESP_OK);

  // initialize A2DP sink and set the data callback(A2DP is bluetooth audio)
  esp_a2d_register_callback(bt_a2d_cb);
  esp_a2d_sink_register_data_callback(bt_data_cb);
  esp_a2d_sink_init();
  
  // set discoverable and connectable mode, wait to be connected
  esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE); // for newer ESP-IDF
  esp_bt_gap_register_callback(bt_gap_cb);

#if (CONFIG_BT_SSP_ENABLED == true)
  /* Set default parameters for Secure Simple Pairing */
  esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
  esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
  esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
#endif

  /*
   * Set default parameters for Legacy Pairing
   * Use fixed pin code
  */
  esp_bt_pin_type_t pin_type = ESP_BT_PIN_TYPE_FIXED;
  esp_bt_pin_code_t pin_code;
	pin_code[0] = '1';
  pin_code[1] = '2';
  pin_code[2] = '3';
  pin_code[3] = '4';
  esp_bt_gap_set_pin(pin_type, 4, pin_code); 
}

void handleBT() {
}

